//-------------------------------------------------------------------------Ч 
#include <stdio.h> 
#include <conio.h> 
#include <math.h> 
//-------------------------------------------------------------------------Ч 

void main()
{
	int N;
	int sum = 0;
	printf("Vvedite chislo N\n"); // вводим число N 
	scanf_s("%d", &N);
	if (N <= 2) 
		printf("1 ");
	else
	{
		for(; N > 0; N--){
			// ‘ормула Ѕине дл€ нахождени€ n-ого числа ‘ибоначчи
			sum += (powf(((1 + sqrtf(5)) / 2), N) - powf(((1 - sqrtf(5)) / 2), N)) / sqrtf(5);
		}
		printf("%d", sum);
	}
	_getch();
}

//---------------------------------------------------------------------------