#define _CRT_SECURE_NO_WARNINGS // для возможности использования scanf
#include <stdio.h>
#include <math.h>
#include <stdbool.h>
//---------------------------------------------------------------------------//
/*
				Лабораторная работа № 9.2
учебной группы 61391
Аббасова Р.М.
03.01.19
Задание: Для каждого слова заданного предложения укажите долю согласных.
Определите слово, в котором доля согласных максимальна. 
*/
//---------------------------------------------------------------------------//

void main(int argc, char* argv[]) {
	setlocale(0, "Russian");
	char stroka[100];
	int slovo[100];
	for(i=0;; )
	gets(stroka);
	printf("%s",stroka);

	getch();

}